DarkTadpole/ghost-globule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The dark tadpole 4572-337</title>
<!-- 2013-10-16 Wed 10:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="William Henney" />
<link rel="stylesheet" type="text/css" href="wjh-org.css" />
</head>
<body>
<div id="content">
<h1 class="title">The dark tadpole 4572-337</h1>
<p>
<a href="DarkTadpole/">DarkTadpole/</a>
</p>
<ul class="org-ul">
<li>Looks like a giant proplyd
</li>
<li>But seen in absorption
</li>
<li>And with a shocked shell too
</li>
<li>Position is <code>5:34:57.199 -5:23:37.49</code>
<ul class="org-ul">
<li>According to Robberto images
</li>
<li>So OW name should be 4572-337
</li>
</ul>
</li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2013-09-16 Mon]</span></span> New name: Ghost Globule
</li>
</ul>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Limits on possible emission</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Looking at cuts across the head, it is possible that there is some Ha emission, but it must be at a very low level.
<ul class="org-ul">
<li>Less than 0.05 in the Bally images
</li>
<li>BG is 2.7 ish
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Depth of absorption</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>BG level (samples near head): 2.74 +/- 0.03, 2.73 +/- 0.03
<ul class="org-ul">
<li>vmeane([2.74 +/- 0.03, 2.73 +/- 0.03]) = 2.735 +/- 0.02
</li>
</ul>
</li>
<li>Core: 2.35
</li>
<li>Head: 2.52 +/- 0.03
</li>
<li>Tail filaments:
<ul class="org-ul">
<li>I: 2.64 +/ 0.02
<ul class="org-ul">
<li>BG = vmeane([2.74 +/- 0.03, 2.80 +/- 0.02]) = 2.78 +/- 0.02
</li>
</ul>
</li>
<li>II: 2.84 +/- 0.03
<ul class="org-ul">
<li>BG = vmeane([2.99 +/- 0.01, 2.92 +/- 0.02]) = 2.98 +/- 0.01
</li>
</ul>
</li>
</ul>
</li>
<li>Shell: BG measured inside and out
<ul class="org-ul">
<li>I (on axis): 2.69 +/- 0.02,
<ul class="org-ul">
<li>BG =  vmeane([2.75 +/- 0.02, 2.72 +/- 0.01]) = 2.726 +/- 0.01
</li>
</ul>
</li>
<li>II (to W): 2.69 +/- 0.01,
<ul class="org-ul">
<li>BG = vmeane([2.71 +/- 0.02, 2.72 +/- 0.02]) = 2.715 +/- 0.01
</li>
</ul>
</li>
<li>III (further to W): 2.64 +/- 0.02,
<ul class="org-ul">
<li>BG = vmeane([2.68 +/- 0.02, 2.67 +/- 0.02]) = 2.675 +/- 0.01
</li>
</ul>
</li>
<li>IV (to E): 2.74 +/- 0.02,
<ul class="org-ul">
<li>BG = vmeane([2.77 +/- 0.02, 2.76 +/- 0.02]) = 2.765 +/- 0.01
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Calculating the extinction</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>We can calculate a lower limit on the extinction by assuming that all the BG emission comes from behind the tadpole, so that A<sub>&lambda;</sub> = -2.5 log<sub>10</sub> (B/BG)
<ul class="org-ul">
<li>This gives a value of A<sub>H&alpha; </sub>= 0.165 for the core, 0.09 for the head and 0.01 for the shell
</li>
</ul>
</li>
<li>Alternatively, we can find an upper limit by assuming that the core extinction is actually large (say 3), implying that 2.33/2.735 = 85% of the BG emission must come from in front of the tadpole.
<ul class="org-ul">
<li>This gives A<sub>H&alpha; </sub>= &infin; for the core, 0.9 for the head, and 0.1 for the shell
</li>
</ul>
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Region</th>
<th scope="col" class="left">Bright</th>
<th scope="col" class="left">mean BG</th>
<th scope="col" class="left">-2.5 log(B/BG)</th>
<th scope="col" class="left">-2.5 log(B'/BG')</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Core</td>
<td class="left">2.35</td>
<td class="left">2.735 +/- 0.02</td>
<td class="left">0.165 +/- 0.008</td>
<td class="left">3.266 +/- 0.054</td>
</tr>

<tr>
<td class="left">Head</td>
<td class="left">2.52 +/- 0.03</td>
<td class="left">2.735 +/- 0.02</td>
<td class="left">0.089 +/- 0.015</td>
<td class="left">0.822 +/- 0.180</td>
</tr>

<tr>
<td class="left">Tail I</td>
<td class="left">2.64 +/- 0.02</td>
<td class="left">2.78 +/- 0.02</td>
<td class="left">0.056 +/- 0.011</td>
<td class="left">0.405 +/- 0.085</td>
</tr>

<tr>
<td class="left">Tail II</td>
<td class="left">2.84 +/- 0.03</td>
<td class="left">2.98 +/- 0.01</td>
<td class="left">0.052 +/- 0.012</td>
<td class="left">0.263 +/- 0.066</td>
</tr>

<tr>
<td class="left">Shell I</td>
<td class="left">2.69 +/- 0.02</td>
<td class="left">2.726 +/- 0.01</td>
<td class="left">0.014 +/- 0.009</td>
<td class="left">0.103 +/- 0.066</td>
</tr>

<tr>
<td class="left">Shell II</td>
<td class="left">2.69 +/- 0.01</td>
<td class="left">2.715 +/- 0.01</td>
<td class="left">0.010 +/- 0.006</td>
<td class="left">0.073 +/- 0.041</td>
</tr>

<tr>
<td class="left">Shell III</td>
<td class="left">2.64 +/- 0.02</td>
<td class="left">2.675 +/- 0.01</td>
<td class="left">0.014 +/- 0.009</td>
<td class="left">0.116 +/- 0.077</td>
</tr>

<tr>
<td class="left">Shell IV</td>
<td class="left">2.74 +/- 0.02</td>
<td class="left">2.765 +/- 0.01</td>
<td class="left">0.010 +/- 0.009</td>
<td class="left">0.064 +/- 0.059</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Sizes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Head radius:
<ul class="org-ul">
<li>axis: 1.7 arcsec
</li>
<li>side (east): 1.9 arcsec
</li>
<li>side (west): 1.7 arcsec
</li>
</ul>
</li>
<li>Head thickness
<ul class="org-ul">
<li>0.36 arcsec
</li>
</ul>
</li>
<li>Core size (diameter):
<ul class="org-ul">
<li>major axis (PA 50): 0.25 arcsec
</li>
<li>minor axis: 0.12 arcsec
</li>
</ul>
</li>
<li>Shell radius:
<ul class="org-ul">
<li>axis: 6.9 arcsec
</li>
<li>side (east): 5.3 arcsec
</li>
<li>side (west): 5.9 arcsec
</li>
</ul>
</li>
<li>Shell thickness:
<ul class="org-ul">
<li>axis: 0.5 arcsec
</li>
<li>side (west): 0.8 arcsec
</li>
<li>side (east): 0.7 arcsec
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Density estimates</h2>
<div class="outline-text-2" id="text-5">
<p>
All assume D = 440 pc, sigma = 5e-22 cm<sup>2</sup>/H
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Core</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Path length ~= 0.2 440 au = 1.312e15 cm
</li>
<li>Minimum column
<ul class="org-ul">
<li>A = 0.165
</li>
<li>N = 3.3e20 cm<sup>-2</sup>
</li>
<li>n = 2.5e5  cm<sup>-3</sup>
</li>
</ul>
</li>
<li>Mass
<ul class="org-ul">
<li>assume area = pi (0.1 440 au)**2 = 1.36e30 cm<sup>2</sup>
</li>
<li>M = 1.36e30 3.3e20 mp /msun = 3.77e-7 M<sub>o</sub>
</li>
</ul>
</li>
<li>Escape velocity
<ul class="org-ul">
<li>V = sqrt(2 G M / R) = 0.004 km/s
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Head</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Path length ~= 2 (R h)  = 1.6 440 au = 1.05e16 cm
</li>
<li>Minimum column
<ul class="org-ul">
<li>A = 0.09
</li>
<li>N = 1.8e20 cm<sup>-2</sup>
</li>
<li>n = 17,000 cm<sup>-3</sup>
</li>
</ul>
</li>
<li>Maximum column
<ul class="org-ul">
<li>A = 0.888
</li>
<li>N = 1.776e21
</li>
<li>n = 170,000 cm<sup>-3</sup>
</li>
</ul>
</li>
<li>Mass 
<ul class="org-ul">
<li>assume area = pi (1.7 440 au)**2 = 3.93e32 cm<sup>2</sup>
</li>
<li>M = 3.93e32 1.8e20 mp / msun = 5.95e-5 M<sub>o</sub> = 20 M<sub>&oplus;</sub>
</li>
</ul>
</li>
<li>Escape velocity
<ul class="org-ul">
<li>V = sqrt(2 G M / R) = 0.017 km/s
</li>
<li>So certainly not self-gravitating
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Shell</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Path length ~= 2 (R h)<sup>1/2</sup> = 3.7 440 au =2.435e16 cm
</li>
<li>Minimum column
<ul class="org-ul">
<li>A = 0.012
</li>
<li>N = 2.4e19 cm<sup>-2</sup>
</li>
<li>n = 1000 cm<sup>-3</sup>
</li>
</ul>
</li>
<li>Maximum column
<ul class="org-ul">
<li>A = 0.1
</li>
<li>N = 2e20 cm<sup>-2</sup>
</li>
<li>n = 8000 cm<sup>-3</sup>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Required ionizing flux if it is an ionized flow from head</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Ionized density at head</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Ionized density should be 1/40 of neutral density, assuming T = 1000 K and D-critical
<ul class="org-ul">
<li>Implies n = 425 cm<sup>-3</sup>
</li>
<li>Although this could be modified if magnetic support were important on the neutral side
</li>
</ul>
</li>
<li>On the other hand, shell is inconsistent with this:
<ul class="org-ul">
<li>Shell radius is 4 times head radius =&gt; geometric dilution of 16
</li>
<li>Assume M = 3, means that shell density should be 16/3 = 5.3 times smaller than i-front density
</li>
<li>Implying n = 5300 at ionization front
</li>
<li>This could work if shock was still going into head
<ul class="org-ul">
<li>There would be a 2e5 cm<sup>-3</sup> layer behind i-front, but if it were thin enough it wouldn't show up
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Recombination limit</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>F = &alpha; n<sup>2</sup> h
</li>
<li>&alpha; = 2.6e-13 cm<sup>3</sup>/s
</li>
<li>n = 5300 cm<sup>-3</sup>
</li>
<li>h = 0.1 R = 75 AU = 1.12e15 cm
</li>
<li>=&gt; F = 8.18e9 cm<sup>-2</sup>
</li>
</ul>
</div>
</div>
