shadowdisks.org
** Required FUV flux if it is a neutral flow from head
+ The idea is that the head and core will be molecular with T = 30-50 K
+ Then the gas is dissociated, lowering its density and flowing out in a neutral photoevaporation flow with T ~ 300 K
  + This will have lower density, but the jump may be signifcantly less than 40 since the molecular gas is likely to be magnetically dominated
  + Assuming Alfven speed of V_{A} \approx 1 km/s
*** Neutral density at the head
+ Sound speed: c = sqrt(k T / m) = 1.4 km/s T_{300}^{1/2} for neutral gas (m = 1.3 mp)
  + For molecular gas @ 30 K: c = 0.3 km/s
+ D-type transonic dissociation front will have P_{m} = 2 P_{n}
+ Assume P_{m} is dominated by magnetic pressure:  P_{m} = 0.5 \rho_{m} V_{A}^{2} = 2 \rho_{n} c_{n}^{2}
  + =>  \rho_{n} / \rho_{m} =  0.25 (V_{A} / c_{n})^{2} = 0.128 V_{1}^{2} / T_{300}
  + where V_{1} is molecular Alfven speed in units of 1 km/s
+ Since we have n_{m} = 1.7e4 pcc (this is H nucleon density) this implies:
  + n_{n} = 2200 V_{1}^{2} / T_{300} pcc
+ This is more or less consistent with the shell density of 1000 pcc
  + which implies n_{n} = (1000 16) / M_{sh} = 5300 M_{3}^{-1} pcc
  + [ ] so long as neutral flow is isothermal (need to check heating timescale)
+ So it would work with V_{A,m} = 1.7 km/s and T_{n} = 300 K or similar combination
  + Implies \beta_{m} = 2 c^{2} / V_{A}^{2} = 0.06
  + [ ] Would this cause anisotropic compression?
  + In neutral gas, B would be smaller or equal to strength in molecular gas
    + equal in the case of B perp to front
    + so neutral V_{A} goes down by sqrt of density jump => V_{A} < 0.95 km/s
    + => \beta_{n} > 4.3, so neutral gas is thermally dominated but not by much
*** Advection limit for dissociation
+ F = 0.5 u n / f_{d}
+ u = c = 1.4  T_{300}^{1/2} km/s
+ n = 5300 pcc
+ f_{d} \approx 0.1 (dissociation fraction for Solomon process)
+ => F = 3.71e9 phot/cm^{2}
+ Habing Flux is 1.213e7
+ So G/G_{0} \approx 300
+ And G/n = 0.02 - is this big or small?
  + Seems to be small - see next item
+ Main IF in Orion has
  + G = 2.5e13 => G/G_{0} = 2e6
  + n < 1e6 certainly, so G/n \sim 1
**** And what would column of neutral flow be?
+ Column \approx n_{0} r_{0}
  + Is this still true for accelerated flows?
+ With n_{0} = 5300 pcc and r_{0} = 1.12e16 cm
+ => N = 5.936e19 cm, or A_{V} = 0.03
+ [ ] Is it feasible to have the heating/dissociation front at such a low column?

*** And what if the shell corresponded to an ionization front?
+ Or more exactly, the neutral shell behind the i-front
+ Neutral density in shell: n = 1000 pcc
+ Again assume D-critical transition
  + P_{n} = 2 P_{i} where this time they are both thermally dominated
    + P_{n} = \rho_{n} c_{n}^{2} and  P_{i} = \rho_{i} c_{i}^{2} with c_{n} \approx 1.4 km/s, c_{i} \approx 10 km/s
    + => n_{i} = 0.01 n_{n} = 10 pcc - that is very low!
  + That would mean an advective flux of  c_{i} n_{i} = 1e7 /cm^{2}/s
  + Recombination flux of 0.1 R \alpha n^{2}
    + R = 7 arcsec = 4.6e16 cm
    + => F = 1.2e5 /cm^{2}/s
    + which is completely negligible
  + This implies a low luminosity for the ionizing star
    + With no attenuation @1.32e19 cm: QH = 2.2e46

*** How can the shell-as-i-front scenario be salvaged?

**** Smaller density jump across the i-front
+ This would require either:
  1) magnetic support in the neutral shell, or
  2) higher T in the neutral shell
**** Large attenuation of ionizing radiation by recombinations in HII region
+ Ratio of 

** Illuminating star?
These are the only ones in the right direction:
| Star        |   HIP | RA                | Dec               | Sp T  |     \Delta\alpha |      \Delta\delta |      D |   PA |
|-------------+-------+-------------------+-------------------+-------+--------+---------+--------+------|
| Globule     |       | 5@ 34' 57.199"    | -5@ 23' 37.49"    |       |    0.0 |     0.0 |    0.0 |  0e0 |
|-------------+-------+-------------------+-------------------+-------+--------+---------+--------+------|
| HD 36939    |       | 5@ 34' 55.265"    | -5@ 30' 23.40"    | B9V   |  -28.9 |  -405.9 |  406.9 | 184. |
| HD 36917    |       | 05@ 34' 46.984"   | -05@ 34' 14.59"   | A0V   | -152.5 |  -637.1 |  655.1 | 193. |
| iota Ori    | 26241 | 05@ 35' 25.982"   | -05@ 54' 35.64"   | O9III |  429.8 | -1858.2 | 1907.3 | 167. |
| ADS 4182 AB |       | 05@ 35' 02.68"    | -06@ 00' 07.2"    | B0    |   81.9 | -2189.7 | 2191.2 | 178. |
| HR 1887     | 26199 | 05@ 35' 02.68074" | -06@ 00' 07.3036" | B0.5V |   81.9 | -2189.8 | 2191.3 | 178. |
| HR 1886     | 26197 | 05@ 35' 01.00645" | -06@ 00' 33.3828" | B1v   |   56.9 | -2215.9 | 2216.6 | 179. |
#+TBLFM: $6=3600 * 15  * 0.995572228862 * deg($3 - @I$3) ;f1::$7=3600 deg($4 - @I$4);f1::$8=sqrt($6**2 + $7**2);f1::$9=arctan2($6, $7) % 360;f0

+ The first two do not seem promising at all.
  + At least, not for ionizing photons
    + Required flux is about 1e10 cm^{-2}
    + So at D = 430 arcsec = 2.83e18 cm, we need QH = 4 pi D**2 F = 1e48 phot/s
    + This is equivalent to a B0 star, not a B9 star
+ Iota Orionis looks more promising, except for the direction
  + There are some B0 stars as well
  + For ionizing photons, it is still too faint
    + D = 2000 arcsec = 1.32e19 cm (4.27 pc)
    + => required ionizing luminosity: 2.2e49 phot/s
    + I think this is more than a O9III star could provide
    + *No it is not!* 2e49 is spot on
  + For FUV photons, required flux is 3.71e9
    + => FUV photon luminosity of 8e48
    + Could be larger if real distance is larger than projected distance.
