DarkTadpole/ghost-globule.html

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3">Advection limit</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>F = u n
</li>
<li>u = c = 10 km/s
</li>
<li>=&gt; F = 5.3e9 cm<sup>-2</sup>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Required FUV flux if it is a neutral flow from head</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>The idea is that the head and core will be molecular with T = 30-50 K
</li>
<li>Then the gas is dissociated, lowering its density and flowing out in a neutral photoevaporation flow with T ~ 300 K
<ul class="org-ul">
<li>This will have lower density, but the jump may be signifcantly less than 40 since the molecular gas is likely to be magnetically dominated
</li>
<li>Assuming Alfven speed of V<sub>A</sub> &asymp; 1 km/s
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Neutral density at the head</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Sound speed: c = sqrt(k T / m) = 1.4 km/s T<sub>300</sub><sup>1/2</sup> for neutral gas (m = 1.3 mp)
<ul class="org-ul">
<li>For molecular gas @ 30 K: c = 0.3 km/s
</li>
</ul>
</li>
<li>D-type transonic dissociation front will have P<sub>m</sub> = 2 P<sub>n</sub>
</li>
<li>Assume P<sub>m</sub> is dominated by magnetic pressure:  P<sub>m</sub> = 0.5 &rho;<sub>m</sub> V<sub>A</sub><sup>2</sup> = 2 &rho;<sub>n</sub> c<sub>n</sub><sup>2</sup>
<ul class="org-ul">
<li>=&gt;  &rho;<sub>n</sub> / &rho;<sub>m</sub> =  0.25 (V<sub>A</sub> / c<sub>n</sub>)<sup>2</sup> = 0.128 V<sub>1</sub><sup>2</sup> / T<sub>300</sub>
</li>
<li>where V<sub>1</sub> is molecular Alfven speed in units of 1 km/s
</li>
</ul>
</li>
<li>Since we have n<sub>m</sub> = 1.7e4 pcc (this is H nucleon density) this implies:
<ul class="org-ul">
<li>n<sub>n</sub> = 2200 V<sub>1</sub><sup>2</sup> / T<sub>300</sub> pcc
</li>
</ul>
</li>
<li>This is more or less consistent with the shell density of 1000 pcc
<ul class="org-ul">
<li>which implies n<sub>n</sub> = (1000 16) / M<sub>sh</sub> = 5300 M<sub>3</sub><sup>-1</sup> pcc
</li>
<li><code>[&#xa0;]</code> so long as neutral flow is isothermal (need to check heating timescale)
</li>
</ul>
</li>
<li>So it would work with V<sub>A,m</sub> = 1.7 km/s and T<sub>n</sub> = 300 K or similar combination
<ul class="org-ul">
<li>Implies &beta;<sub>m</sub> = 2 c<sup>2</sup> / V<sub>A</sub><sup>2</sup> = 0.06
</li>
<li><code>[&#xa0;]</code> Would this cause anisotropic compression?
</li>
<li>In neutral gas, B would be smaller or equal to strength in molecular gas
<ul class="org-ul">
<li>equal in the case of B perp to front
</li>
<li>so neutral V<sub>A</sub> goes down by sqrt of density jump =&gt; V<sub>A</sub> &lt; 0.95 km/s
</li>
<li>=&gt; &beta;<sub>n</sub> &gt; 4.3, so neutral gas is thermally dominated but not by much
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Advection limit for dissociation</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>F = 0.5 u n / f<sub>d</sub>
</li>
<li>u = c = 1.4  T<sub>300</sub><sup>1/2</sup> km/s
</li>
<li>n = 5300 pcc
</li>
<li>f<sub>d</sub> &asymp; 0.1 (dissociation fraction for Solomon process)
</li>
<li>=&gt; F = 3.71e9 phot/cm<sup>2</sup>
</li>
<li>Habing Flux is 1.213e7
</li>
<li>So G/G<sub>0</sub> &asymp; 300
</li>
<li>And G/n = 0.02 - is this big or small?
<ul class="org-ul">
<li>Seems to be small - see next item
</li>
</ul>
</li>
<li>Main IF in Orion has
<ul class="org-ul">
<li>G = 2.5e13 =&gt; G/G<sub>0</sub> = 2e6
</li>
<li>n &lt; 1e6 certainly, so G/n &sim; 1
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1">And what would column of neutral flow be?</h4>
<div class="outline-text-4" id="text-7-2-1">
<ul class="org-ul">
<li>Column &asymp; n<sub>0</sub> r<sub>0</sub>
<ul class="org-ul">
<li>Is this still true for accelerated flows?
</li>
</ul>
</li>
<li>With n<sub>0</sub> = 5300 pcc and r<sub>0</sub> = 1.12e16 cm
</li>
<li>=&gt; N = 5.936e19 cm, or A<sub>V</sub> = 0.03
</li>
<li><code>[&#xa0;]</code> Is it feasible to have the heating/dissociation front at such a low column?
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">And what if the shell corresponded to an ionization front?</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Or more exactly, the neutral shell behind the i-front
</li>
<li>Neutral density in shell: n = 1000 pcc
</li>
<li>Again assume D-critical transition
<ul class="org-ul">
<li>P<sub>n</sub> = 2 P<sub>i</sub> where this time they are both thermally dominated
<ul class="org-ul">
<li>P<sub>n</sub> = &rho;<sub>n</sub> c<sub>n</sub><sup>2</sup> and  P<sub>i</sub> = &rho;<sub>i</sub> c<sub>i</sub><sup>2</sup> with c<sub>n</sub> &asymp; 1.4 km/s, c<sub>i</sub> &asymp; 10 km/s
</li>
<li>=&gt; n<sub>i</sub> = 0.01 n<sub>n</sub> = 10 pcc - that is very low!
</li>
</ul>
</li>
<li>That would mean an advective flux of  c<sub>i</sub> n<sub>i</sub> = 1e7 /cm<sup>2</sup>/s
</li>
<li>Recombination flux of 0.1 R &alpha; n<sup>2</sup>
<ul class="org-ul">
<li>R = 7 arcsec = 4.6e16 cm
</li>
<li>=&gt; F = 1.2e5 /cm<sup>2</sup>/s
</li>
<li>which is completely negligible
</li>
</ul>
</li>
<li>This implies a low luminosity for the ionizing star
<ul class="org-ul">
<li>With no attenuation @1.32e19 cm: QH = 2.2e46
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">How can the shell-as-i-front scenario be salvaged?</h3>
<div class="outline-text-3" id="text-7-4">
</div><div id="outline-container-sec-7-4-1" class="outline-4">
<h4 id="sec-7-4-1">Smaller density jump across the i-front</h4>
<div class="outline-text-4" id="text-7-4-1">
<ul class="org-ul">
<li>This would require either:
<ol class="org-ol">
<li>magnetic support in the neutral shell, or
</li>
<li>higher T in the neutral shell
</li>
</ol>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-4-2" class="outline-4">
<h4 id="sec-7-4-2">Large attenuation of ionizing radiation by recombinations in HII region</h4>
<div class="outline-text-4" id="text-7-4-2">
<ul class="org-ul">
<li>Ratio of 
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Illuminating star?</h2>
<div class="outline-text-2" id="text-8">
<p>
These are the only ones in the right direction:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Star</th>
<th scope="col" class="right">HIP</th>
<th scope="col" class="left">RA</th>
<th scope="col" class="left">Dec</th>
<th scope="col" class="left">Sp T</th>
<th scope="col" class="right">&Delta;&alpha;</th>
<th scope="col" class="right">&Delta;&delta;</th>
<th scope="col" class="right">D</th>
<th scope="col" class="right">PA</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Globule</td>
<td class="right">&#xa0;</td>
<td class="left">5@ 34' 57.199"</td>
<td class="left">-5@ 23' 37.49"</td>
<td class="left">&#xa0;</td>
<td class="right">0.0</td>
<td class="right">0.0</td>
<td class="right">0.0</td>
<td class="right">0e0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">HD 36939</td>
<td class="right">&#xa0;</td>
<td class="left">5@ 34' 55.265"</td>
<td class="left">-5@ 30' 23.40"</td>
<td class="left">B9V</td>
<td class="right">-28.9</td>
<td class="right">-405.9</td>
<td class="right">406.9</td>
<td class="right">184.</td>
</tr>

<tr>
<td class="left">HD 36917</td>
<td class="right">&#xa0;</td>
<td class="left">05@ 34' 46.984"</td>
<td class="left">-05@ 34' 14.59"</td>
<td class="left">A0V</td>
<td class="right">-152.5</td>
<td class="right">-637.1</td>
<td class="right">655.1</td>
<td class="right">193.</td>
</tr>

<tr>
<td class="left">iota Ori</td>
<td class="right">26241</td>
<td class="left">05@ 35' 25.982"</td>
<td class="left">-05@ 54' 35.64"</td>
<td class="left">O9III</td>
<td class="right">429.8</td>
<td class="right">-1858.2</td>
<td class="right">1907.3</td>
<td class="right">167.</td>
</tr>

<tr>
<td class="left">ADS 4182 AB</td>
<td class="right">&#xa0;</td>
<td class="left">05@ 35' 02.68"</td>
<td class="left">-06@ 00' 07.2"</td>
<td class="left">B0</td>
<td class="right">81.9</td>
<td class="right">-2189.7</td>
<td class="right">2191.2</td>
<td class="right">178.</td>
</tr>

<tr>
<td class="left">HR 1887</td>
<td class="right">26199</td>
<td class="left">05@ 35' 02.68074"</td>
<td class="left">-06@ 00' 07.3036"</td>
<td class="left">B0.5V</td>
<td class="right">81.9</td>
<td class="right">-2189.8</td>
<td class="right">2191.3</td>
<td class="right">178.</td>
</tr>

<tr>
<td class="left">HR 1886</td>
<td class="right">26197</td>
<td class="left">05@ 35' 01.00645"</td>
<td class="left">-06@ 00' 33.3828"</td>
<td class="left">B1v</td>
<td class="right">56.9</td>
<td class="right">-2215.9</td>
<td class="right">2216.6</td>
<td class="right">179.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>The first two do not seem promising at all.
<ul class="org-ul">
<li>At least, not for ionizing photons
<ul class="org-ul">
<li>Required flux is about 1e10 cm<sup>-2</sup>
</li>
<li>So at D = 430 arcsec = 2.83e18 cm, we need QH = 4 pi D**2 F = 1e48 phot/s
</li>
<li>This is equivalent to a B0 star, not a B9 star
</li>
</ul>
</li>
</ul>
</li>
<li>Iota Orionis looks more promising, except for the direction
<ul class="org-ul">
<li>There are some B0 stars as well
</li>
<li>For ionizing photons, it is still too faint
<ul class="org-ul">
<li>D = 2000 arcsec = 1.32e19 cm (4.27 pc)
</li>
<li>=&gt; required ionizing luminosity: 2.2e49 phot/s
</li>
<li>I think this is more than a O9III star could provide
</li>
<li><b>No it is not!</b> 2e49 is spot on
</li>
</ul>
</li>
<li>For FUV photons, required flux is 3.71e9
<ul class="org-ul">
<li>=&gt; FUV photon luminosity of 8e48
</li>
<li>Could be larger if real distance is larger than projected distance.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
