DarkTadpole/ghost-globule.html
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Table of stellar parameters</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>From Hohle et al (2010) 2010AN&#x2026;.331..349H
</li>
<li>Surface gravity is calculated as g = G M / R<sup>2</sup> = G M 4 &pi; &sigma; T<sup>4</sup> / L
</li>
<li>Luminosity and mass for &iota; Ori B are my guesses
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">name</th>
<th scope="col" class="right">HIP</th>
<th scope="col" class="left">Sp T</th>
<th scope="col" class="right">Teff</th>
<th scope="col" class="right">L<sub>bol</sub> / L<sub>o</sub></th>
<th scope="col" class="left">M / M<sub>o</sub></th>
<th scope="col" class="left">log g</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&iota; Ori</td>
<td class="right">26241</td>
<td class="left">O9 III</td>
<td class="right">32000</td>
<td class="right">5.29e5</td>
<td class="left">32.74 +/- 13.89</td>
<td class="left">3.21 +/- 0.18</td>
</tr>

<tr>
<td class="left">&iota; Ori B</td>
<td class="right">&#xa0;</td>
<td class="left">B1V</td>
<td class="right">24000</td>
<td class="right">37000</td>
<td class="left">15</td>
<td class="left">3.52</td>
</tr>

<tr>
<td class="left">HR 1886</td>
<td class="right">26197</td>
<td class="left">B1 V</td>
<td class="right">25400</td>
<td class="right">37459</td>
<td class="left">15.00 +/- 0.45</td>
<td class="left">3.62 +/- 0.01</td>
</tr>

<tr>
<td class="left">HR 1887</td>
<td class="right">26199</td>
<td class="left">B0.5 V</td>
<td class="right">27700</td>
<td class="right">37663</td>
<td class="left">15.66 +/- 0.5</td>
<td class="left">3.78 +/- 0.01</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">Another table of stellar parameters for the &iota; Ori binary</h3>
<div class="outline-text-3" id="text-8-2">
<p>
From \cite{Stickland:1987a}
</p>
<ul class="org-ul">
<li>They find E(B - V) &asymp; 0.03 =&gt; A<sub>V</sub> &asymp; 0.1 mag
</li>
<li>And use a distance modulus of &mu; = 8.52 +/- 0.17
<ul class="org-ul">
<li>Corresponding to distance of 10**(0.2 (8.52 +/- 0.17) + 1) = 506 +/- 40 pc
</li>
<li>So if the distance were really 400 +/- 100 pc, we would have &mu; = 8.01 +/- 0.54
</li>
<li>Or, using (436 +/- 20) - (4 +/- 4) = 432 +/- 20.4
<ul class="org-ul">
<li>Coming from the O'Dell &amp; Henney (2008) recommendation together with assuming that &Delta; z &sim; &Delta; r for the &iota;--&theta;<sup>1</sup> distance
</li>
<li>which implies that &mu; = 8.18 +/- 0.10, which gives a correction of 0.34 +/- 0.10 to the absolute magnitudes
</li>
</ul>
</li>
<li>This would reduce the bolometric luminosities a tad wrt to the Stickland values, which is included in the following table: 
</li>
</ul>
</li>
<li>Relationship between absolute magnitude and luminosity:
<ul class="org-ul">
<li>log<sub>10</sub> L/L<sub>o</sub>  = -0.4 (M<sub>bol</sub> - M<sub>bol,o</sub>),
</li>
<li>where M<sub>bol,o</sub> = (+4.862 +/- 0.02) + (-0.107+-0.02) = 4.735 +/- 0.02
<ul class="org-ul">
<li>Pecaut &amp; Mamajek (2013)
</li>
<li><a href="https://sites.google.com/site/mamajeksstarnotes/basic-astronomical-data-for-the-sun">mamajeksstarnotes/basic-astronomical-data-for-the-sun</a>
</li>
</ul>
</li>
<li>Alternatively, IAU Commissions 25 and 36 simply define a zero point for the absolute magnitude scale of L<sub>0</sub> = 3.055e28 W = 3.055e35 erg/s = 79.974 L<sub>o</sub>
<ul class="org-ul">
<li>This means that L = L<sub>0</sub> 10<sup>-0.4 M</sup>
</li>
</ul>
</li>
</ul>
</li>
<li>Calculation of Radii:
<ul class="org-ul">
<li>4 &pi; R<sup>2</sup> &sigma; T<sup>4</sup> = L <code>&gt; =$R = sqrt( $L / 4 $pi $sigma $T**4)</code>
</li>
<li>We include a 5% uncertanty in T<sub>eff</sub> measurement
</li>
</ul>
</li>
<li>Masses are from binary orbit solution of Strickland
</li>
<li>Gravity is then just G M / R<sup>2</sup>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">name</th>
<th scope="col" class="left">Sp T</th>
<th scope="col" class="right">Teff</th>
<th scope="col" class="left">M<sub>bol</sub></th>
<th scope="col" class="left">log L<sub>bol</sub> / L<sub>o</sub></th>
<th scope="col" class="left">R / R<sub>o</sub></th>
<th scope="col" class="left">M / M<sub>o</sub></th>
<th scope="col" class="left">log g</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&iota; Ori</td>
<td class="left">O9 III</td>
<td class="right">32000</td>
<td class="left">-8.36 +/- 0.1</td>
<td class="left">5.247 +/- 0.040</td>
<td class="left">13.65 +/- 1.50</td>
<td class="left">38.9 +/- 9.7</td>
<td class="left">3.76 +/- 0.14</td>
</tr>

<tr>
<td class="left">&iota; Ori B</td>
<td class="left">B1 III</td>
<td class="right">21000</td>
<td class="left">-5.46 +/- 0.1</td>
<td class="left">4.087 +/- 0.040</td>
<td class="left">8.34 +/- 0.92</td>
<td class="left">18.9 +/- 4.7</td>
<td class="left">3.87 +/- 0.14</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>So the luminosity is significantly lower than before, by a factor of 3
</li>
<li>I have saved the original versions in <code>stars/old/</code>
</li>
<li>The new version has QH = 3.4e48, which is 5 times lower than before, unfortunately. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3">Cloudy models of the stellar spectra</h3>
<div class="outline-text-3" id="text-8-3">

<p>
This is based on what I did for the <a href="shadowdisks.html#ID-7E209EE8-5EB0-49B8-82F1-99EBE7DC3446">Orion {N I} project</a>
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #eee8aa; font-style: italic;">"""</span>
<span style="color: #eee8aa; font-style: italic;">Generate Cloudy input files for some OB stars in Orion</span>
<span style="color: #eee8aa; font-style: italic;">"""</span>
</pre>
</div>
</div>



<div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1">Trapezium stars</h4>
<div class="outline-text-4" id="text-8-3-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #dfaf8f;">stars</span> = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(
<span style="color: #7f7f7f; background-color: #484848;"> </span>   th1C = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=39000., g=4.1, L=5.31),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   th1A = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=30000., g=4.0, L=4.45),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   th1D = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=32000., g=4.2, L=4.47),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   th1B = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=18000., g=4.1, L=3.25),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   th1C2 = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=25000., g=3.86, L=4.2),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2">NGC 1980 stars</h4>
<div class="outline-text-4" id="text-8-3-2">
<div class="org-src-container">

<pre class="src src-python">stars.update(
<span style="color: #7f7f7f; background-color: #484848;"> </span>   iota = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=32000., g=3.76, L=5.25),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   iotaB = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=21000., g=3.87, L=4.09),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   HR1886 = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=25400., g=3.62, L=4.57),
<span style="color: #7f7f7f; background-color: #484848;"> </span>   HR1887 = <span style="color: #DCDCCC; font-weight: bold;">dict</span>(T=27700., g=3.78, L=4.58),
)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3-3" class="outline-4">
<h4 id="sec-8-3-3">Generate the cloudy input scripts</h4>
<div class="outline-text-4" id="text-8-3-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #dfaf8f;">template</span> = <span style="color: #eee8aa; font-style: italic;">"""\</span>
<span style="color: #eee8aa; font-style: italic;">title Spectrum of Orion star %(id)s using Tlusty</span>
<span style="color: #eee8aa; font-style: italic;">table star tlusty OBstar 3-dim %(T)i g=%(g).2f z=-0.1</span>
<span style="color: #eee8aa; font-style: italic;">luminosity total solar %(L).2f </span>
<span style="color: #eee8aa; font-style: italic;">hden 4</span>
<span style="color: #eee8aa; font-style: italic;">radius 17</span>
<span style="color: #eee8aa; font-style: italic;">stop zone 1</span>
<span style="color: #eee8aa; font-style: italic;">save continuum file="%(id)s.cont"</span>
<span style="color: #eee8aa; font-style: italic;">"""</span>

<span style="color: #b9d3ee;">for</span> star <span style="color: #b9d3ee;">in</span> stars:
<span style="color: #7f7f7f; background-color: #484848;"> </span>   stars[star].update(<span style="color: #DCDCCC; font-weight: bold;">id</span>=star)
<span style="color: #7f7f7f; background-color: #484848;"> </span>   <span style="color: #b9d3ee;">with</span> <span style="color: #DCDCCC; font-weight: bold;">open</span>(star + <span style="color: #eee8aa; font-style: italic;">".in"</span>, <span style="color: #eee8aa; font-style: italic;">"w"</span>) <span style="color: #b9d3ee;">as</span> f:
<span style="color: #7f7f7f; background-color: #484848;"> </span>   <span style="color: #7f7f7f; background-color: #484848;"> </span>   f.write(template % stars[star])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4">Download and compile the Tlusty atmosphere models</h3>
<div class="outline-text-3" id="text-8-4">
</div>


<div id="outline-container-sec-8-4-1" class="outline-4">
<h4 id="sec-8-4-1">Download models</h4>
<div class="outline-text-4" id="text-8-4-1">
<p>
Download <a href="http://nova.astro.umd.edu/Tlusty2002/database/obstar_merged_3d.ascii.gz">http://nova.astro.umd.edu/Tlusty2002/database/obstar_merged_3d.ascii.gz</a> (Note that it is big - 86MB)
</p>
</div>
</div>
