shadowdisks.org
**** Unpack models
#+BEGIN_SRC sh
mv ~/Downloads/obstar_merged_3d.ascii .
#+END_SRC

#+RESULTS:

**** Compile models
#+BEGIN_SRC sh :results verbatim
echo "compile stars" | ../source/cloudy.exe 
#+END_SRC

#+RESULTS:
#+begin_example
                                                         Cloudy 13.01.01
                                                         www.nublado.org

                       **************************************13Jan01**************************************
                       *                                                                                 *
                       * compile stars                                                                   *
 AtlasCompile on the job.
 CoStarCompile on the job.
 Kurucz79Compile on the job.
 MihalasCompile on the job.
 RauchCompile on the job.
 StarburstCompile on the job.
 TlustyCompile on the job.
 WernerCompile on the job.
 WMBASICCompile on the job.

 1 ascii file(s) found, 1 file(s) up to date.

 The compilation was successful!
 The portable ascii files are no longer needed and may be deleted to save space.

 Good Luck!!


 [Stop in ParseCompile at parse_compile.cpp:507, Cloudy exited OK]
#+end_example

**** Check models are there
#+BEGIN_SRC sh :results output 
echo "table star available" | ../source/cloudy.exe 
#+END_SRC

#+RESULTS:
#+begin_example
                                                         Cloudy 13.01.01
                                                         www.nublado.org

                       **************************************13Jan01**************************************
                       *                                                                                 *
                       * table star available                                                            *

 I will now list all stellar atmosphere grids that are ready to be used (if any).
 User-defined stellar atmosphere grids will not be included in this list.

   table star tlusty OBstar 3-dim <Teff> <log(g)> <log(Z)>
 [Stop in ParseTable at parse_table.cpp:1273, Cloudy exited OK]
#+end_example

*** Makefile to run the cloudy jobs
	:PROPERTIES:
        :tangle:   stars/Makefile
	:END:
#+begin_src makefile
CLOUDY=cloudy.exe
SRC = $(wildcard *.in)
OBJ = $(SRC:.in=.out)

all: $(OBJ)

%.out: %.in
	$(CLOUDY) < $< > $@ 
#+end_src

*** Regenerate input files and run make
:PROPERTIES:
:dir:      stars
:END:

#+begin_src sh :results output
python ./generate-orion-seds.py
export PATH=$PATH:~/Work/CLOUDY/git-svn/source
make -j 6 
#+end_src

#+RESULTS:
: cloudy.exe < HR1886.in > HR1886.out
: cloudy.exe < HR1887.in > HR1887.out
: cloudy.exe < iota.in > iota.out
: cloudy.exe < iotaB.in > iotaB.out
: cloudy.exe < th1A.in > th1A.out
: cloudy.exe < th1B.in > th1B.out
: cloudy.exe < th1C.in > th1C.out
: cloudy.exe < th1C2.in > th1C2.out
: cloudy.exe < th1D.in > th1D.out


*** Original copy of Iota Ori parameters
+ HIP	 26241	 	Hipparcos identification number
+ Magnitudes
  + B = 2.53
  + V = 2.77
  + J = 3.490 +/- 0.304
  + H = 3.648 +/- 0.252
  + K = 3.752 +/- 0.252
+ plx = 1.40 +/- 0.22 mas => D = 714.285714286 +/- 112.244897959 pc
+ SpType	O9 III
+ Teff	 32000	K
+ M = 32.74 +/- 13.89 M_{\odot}
+ L = 5.29e5 L_{\odot}
+ Secondary:
  + B1V
  + Teff 24000 K
  + L unknown - but will be 30% of primary if they have the same radius


*** Stromgren sphere around \iota Ori
+ QH = 2e49
+ R > 4 pc
+ Q_{H} = 4/3 pi R^{3} n^{2} \alpha
+ => n = sqrt( Q_{H} / 4/3 pi R^{3} \alpha) = 100 R_{4}^{-3/2} pcc


** Vizier acknowledgments
This research has made use of the VizieR catalogue access tool, CDS, Strasbourg, France. The original description of the VizieR service was published in A&AS 143, 23
