DarkTadpole/ghost-globule.html

<div id="outline-container-sec-8-4-2" class="outline-4">
<h4 id="sec-8-4-2">Unpack models</h4>
<div class="outline-text-4" id="text-8-4-2">
<div class="org-src-container">

<pre class="src src-sh">mv ~/Downloads/obstar_merged_3d.ascii .
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-4-3" class="outline-4">
<h4 id="sec-8-4-3">Compile models</h4>
<div class="outline-text-4" id="text-8-4-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #eee8aa; font-style: italic;">"compile stars"</span> | ../source/cloudy.exe
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-4-4" class="outline-4">
<h4 id="sec-8-4-4">Check models are there</h4>
<div class="outline-text-4" id="text-8-4-4">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #eee8aa; font-style: italic;">"table star available"</span> | ../source/cloudy.exe
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5">Makefile to run the cloudy jobs</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">

<pre class="src src-makefile"><span style="color: #dfaf8f;">CLOUDY</span>=cloudy.exe
<span style="color: #dfaf8f;">SRC</span> = $(<span style="color: #dfaf8f;">wildcard</span> *.in)
<span style="color: #dfaf8f;">OBJ</span> = $(<span style="color: #dfaf8f;">SRC</span>:<span style="color: #dfaf8f;">.in</span>=.out)

<span style="color: #cccccc;">all</span>: $(<span style="color: #dfaf8f;">OBJ</span>)

<span style="color: #cccccc;">%.out</span>: %.in
        $(<span style="color: #dfaf8f;">CLOUDY</span>) &lt; $<span style="color: #cFfBcF;">&lt;</span> &gt; <span style="color: #cccccc;">$</span><span style="color: #cccccc;">@</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6">Regenerate input files and run make</h3>
<div class="outline-text-3" id="text-8-6">

<div class="org-src-container">

<pre class="src src-sh">python ./generate-orion-seds.py
<span style="color: #DCDCCC; font-weight: bold;">export</span> <span style="color: #dfaf8f;">PATH</span>=$<span style="color: #dfaf8f;">PATH</span>:~/Work/CLOUDY/git-svn/source
make -j 6
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7">Original copy of Iota Ori parameters</h3>
<div class="outline-text-3" id="text-8-7">
<ul class="org-ul">
<li>HIP         26241                 Hipparcos identification number
</li>
<li>Magnitudes
<ul class="org-ul">
<li>B = 2.53
</li>
<li>V = 2.77
</li>
<li>J = 3.490 +/- 0.304
</li>
<li>H = 3.648 +/- 0.252
</li>
<li>K = 3.752 +/- 0.252
</li>
</ul>
</li>
<li>plx = 1.40 +/- 0.22 mas =&gt; D = 714.285714286 +/- 112.244897959 pc
</li>
<li>SpType        O9 III
</li>
<li>Teff         32000        K
</li>
<li>M = 32.74 +/- 13.89 M<sub>o</sub>
</li>
<li>L = 5.29e5 L<sub>o</sub>
</li>
<li>Secondary:
<ul class="org-ul">
<li>B1V
</li>
<li>Teff 24000 K
</li>
<li>L unknown - but will be 30% of primary if they have the same radius
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8">Stromgren sphere around &iota; Ori</h3>
<div class="outline-text-3" id="text-8-8">
<ul class="org-ul">
<li>QH = 2e49
</li>
<li>R &gt; 4 pc
</li>
<li>Q<sub>H</sub> = 4/3 pi R<sup>3</sup> n<sup>2</sup> &alpha;
</li>
<li>=&gt; n = sqrt( Q<sub>H</sub> / 4/3 pi R<sup>3</sup> &alpha;) = 100 R<sub>4</sub><sup>-3/2</sup> pcc
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Vizier acknowledgments</h2>
<div class="outline-text-2" id="text-9">
<p>
This research has made use of the VizieR catalogue access tool, CDS, Strasbourg, France. The original description of the VizieR service was published in A&amp;AS 143, 23</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: William Henney</p>
<p class="date">Created: 2013-10-16 Wed 10:25</p>
<p class="creator">Emacs 24.3.1 (Org mode 8.0.7)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
